SimedruF/ESP32_LILYGOT5_WeatherStation/main.cpp
// According to the board, cancel the corresponding macro definition
#define LILYGO_T5_V213
// #define LILYGO_T5_V22
// #define LILYGO_T5_V24
// #define LILYGO_T5_V28
// #define LILYGO_T5_V102
// #define LILYGO_T5_V266
// #define LILYGO_EPD_DISPLAY_102
// #define LILYGO_EPD_DISPLAY_154

#include <boards.h>
#define EINKDISPLAY
#include <GxEPD.h>

#if defined(LILYGO_T5_V102) || defined(LILYGO_EPD_DISPLAY_102)
#include <GxGDGDEW0102T4/GxGDGDEW0102T4.h> //1.02" b/w
#elif defined(LILYGO_T5_V266)
#include <GxDEPG0266BN/GxDEPG0266BN.h> // 2.66" b/w   form DKE GROUP
#elif defined(LILYGO_T5_V213)
#include <GxDEPG0213BN/GxDEPG0213BN.h> // 2.13" b/w  form DKE GROUP
// #include <GxGDE0213B1.h>
#else
// #include <GxGDGDEW0102T4/GxGDGDEW0102T4.h> //1.02" b/w
// #include <GxGDEW0154Z04/GxGDEW0154Z04.h>  // 1.54" b/w/r 200x200
// #include <GxGDEW0154Z17/GxGDEW0154Z17.h>  // 1.54" b/w/r 152x152
// #include <GxGDEH0154D67/GxGDEH0154D67.h>  // 1.54" b/w
// #include <GxDEPG0150BN/GxDEPG0150BN.h>    // 1.51" b/w   form DKE GROUP
// #include <GxDEPG0266BN/GxDEPG0266BN.h>    // 2.66" b/w   form DKE GROUP
// #include <GxDEPG0290R/GxDEPG0290R.h>      // 2.9" b/w/r  form DKE GROUP
// #include <GxDEPG0290B/GxDEPG0290B.h>      // 2.9" b/w    form DKE GROUP
// #include <GxGDEW029Z10/GxGDEW029Z10.h>    // 2.9" b/w/r  form GoodDisplay
// #include <GxGDEW0213Z16/GxGDEW0213Z16.h>  // 2.13" b/w/r form GoodDisplay
// #include <GxGDE0213B1/GxGDE0213B1.h>      // 2.13" b/w  old panel , form GoodDisplay
// #include <GxGDEH0213B72/GxGDEH0213B72.h>  // 2.13" b/w  old panel , form GoodDisplay
// #include <GxGDEH0213B73/GxGDEH0213B73.h>  // 2.13" b/w  old panel , form GoodDisplay
// #include <GxGDEM0213B74/GxGDEM0213B74.h>  // 2.13" b/w  form GoodDisplay 4-color
// #include <GxGDEW0213M21/GxGDEW0213M21.h>  // 2.13"  b/w Ultra wide temperature , form GoodDisplay
// #include <GxDEPG0213BN/GxDEPG0213BN.h>    // 2.13" b/w  form DKE GROUP
// #include <GxGDEW027W3/GxGDEW027W3.h>      // 2.7" b/w   form GoodDisplay
// #include <GxGDEW027C44/GxGDEW027C44.h>    // 2.7" b/w/r form GoodDisplay
// #include <GxGDEH029A1/GxGDEH029A1.h>      // 2.9" b/w   form GoodDisplay
// #include <GxDEPG0750BN/GxDEPG0750BN.h>    // 7.5" b/w   form DKE GROUP
#endif

#include GxEPD_BitmapExamples
// FreeFonts from Adafruit_GFX
#include <Fonts/FreeMono9pt7b.h>
// #include <Fonts/Tiny3x3a2pt7b.h>
// #include <Fonts/FreeMonoBold9pt7b.h>
// #include <Fonts/FreeMonoBold12pt7b.h>
// #include <Fonts/FreeMonoBold18pt7b.h>
#include <Fonts/Picopixel.h>
#include <GxIO/GxIO_SPI/GxIO_SPI.h>
#include <GxIO/GxIO.h>
#include <qrcode.h>
#include <Wifi.h>
#include <HTTPClient.h>
#include <PubSubClient.h>
#include <Adafruit_INA219.h>
#include <ArduinoJson.h>
#include <Time.h>
#include <ESP32Time.h>
#include <ESPAsyncWebServer.h>
#include <vector>
#include <string>
#include <sstream>
#include <iostream>
#include <EEPROM.h>

#define SERIAL_DEBUG_ON
#define SERIAL_TIME_DATE_OFF
#define uS_TO_S_FACTOR 1000000ULL /* Conversion factor for micro seconds to seconds */
#define TIME_TO_SLEEP 60          /* Time ESP32 will go to sleep (in seconds) */
#define SIBIU 72
#define TG_MURES 39
#define INTORSURA_BUZAULUI 72
#define DEFAULT_CITY_CODE 70
#define CITY_CODE SIBIU

GxIO_Class io(SPI, EPD_CS, EPD_DC, EPD_RSET);
GxEPD_Class display(io, EPD_RSET, EPD_BUSY);
QRcode qrcode(&display);
void callback(char *topic, byte *payload, unsigned int length);
void printPanel();
String printLocalTime();
void printBatStatus(float battery_proc);
void printHeader();
int getWifiStrenght();
void drawWifiStrenght(int bars);
void batteryRead(void);
void setup_clock();
String CheckString(String name, String str);
void SecureClientRead();
std::string getSerialMessages();
String list_wifi_networks();

void handleConnect(AsyncWebServerRequest *request);
void saveCredentials(String ssid, String password);
void loadCredentials(String &ssid, String &password, int &length_ssid, int &length_pass, int &end_ssid, int &end_pass);

/* Put your SSID & Password */
const char *ssid = "SSID";              // Enter SSID here
const char *password = "password"; // Enter Password here

const char *apSSID = "E32_AP_WS";
const char *apPassword = "password";

const char *ntpServer = "pool.ntp.org";
const long gmtOffset_sec = 3600;
const int daylightOffset_sec = 3600;
String wifi_networks;
struct tm timeinfo;
// MQTT Broker
const char *mqtt_broker = "192.168.x.x";
const char *topic_general = "emqx/esp32";
const char *topic_temperatura = "workgroup/c4ca4238a0b923820dcc509a6f75849b/air/temperature";
const char *mqtt_username = "MQTT user";
const char *mqtt_password = "MQTT pass";
const int mqtt_port = 1883;
WiFiClient espClient;
PubSubClient client(espClient);
char mesage_mqtt[200];
float busvoltage_f;
String busvoltage_s;
Adafruit_INA219 ina219;
ESP32Time rtc(3600); // offset in seconds GMT+1
wl_status_t wifi_connection;

String weather_server = "https://www.meteoromania.ro/wp-json/meteoapi/v2/starea-vremii";
HTTPClient http;

const char *test_root_ca = "-----BEGIN CERTIFICATE-----\n"
                           "certificate here\n"
                           "-----END CERTIFICATE-----\n";
String data_meteo;
String temperatura_locala;
String temp_int;
String presiunea_locala;
String viteza_vantului_locala;
String nebulozitate;
String umezeala;
String fenomene_precippitatii;
String zapada;
String actualizat;
String oras;

int page = 0;
String page_str;
const String configured_city_str = "SIBIU";
int city_code_cfg = CITY_CODE;
unsigned long ClockSec = 0; 
unsigned long Clock30Sec = 0;
unsigned long Clock1Sec = 0;
AsyncWebServer server(80);
std::string messages = "";
std::string msg;
bool new_serial_data = false;
bool access_point_configured = false;
bool trigger_reconnect = false;
String List_of_wifi_networks_HTML;
String newSSID;
String newPass;
IPAddress apIP(192, 168, 1, 2);     // Setează adresa IP a punctului de acces WiFi
IPAddress netMsk(255, 255, 255, 0); // Setează masca de subrețea
IPAddress gateway(192, 168, 1, 1);  // Setează gateway-ul

void saveCredentials(String ssid, String password)
{
  String ssid_local = ssid;
  String password_local = password;
  int length_ssid = ssid.length();
  int length_pass = password.length();

