SimedruF/ESP32_LILYGOT5_WeatherStation/main.cpp
  ssid_local = String(length_ssid) + char(2)  + ssid_local + char(3);
  password_local = String(length_pass) + char(2) + password_local + char(3);
  EEPROM.begin(512); // Inițializează EEPROM
  
  // Erase 64 de bytesM
  for (int i = 0; i < 64; ++i)
  {
    EEPROM.write(i, ssid_local[i]);
  }

  // Salvează SSID-ul în primele 32 de bytes ale EEPROM
  for (int i = 0; i < ssid_local.length(); ++i)
  {
    EEPROM.write(i, ssid_local[i]);
  }

  // Salvează parola în următoarele 64 de bytes ale EEPROM
  for (int i = 0; i < password_local.length(); ++i)
  {
    EEPROM.write(32 + i, password_local[i]);
  }

  EEPROM.commit(); // Salvează datele în EEPROM
  EEPROM.end();    // Termină utilizarea EEPROM
}
void loadCredentials(String &ssid, String &password, int &length_ssid, int &length_pass,int &end_ssid, int &end_pass)
{
  String ssid_local = "";
  String password_local = "";
  int loc_end_length_ssid =0;
  int loc_end_length_pass = 0;
  int loc_end_ssid = 0;
  int loc_end_pass = 0;
  EEPROM.begin(512); // Inițializează EEPROM

  // Încarcă SSID-ul din primele 32 de bytes ale EEPROM
  ssid_local = "";
  for (int i = 0; i < 32; ++i)
  {
    char c = EEPROM.read(i);
    if (c == '\0')
      break;
    if (c == '\2')
    {
      loc_end_length_ssid = i;
    }
    if (c == '\3')
    {
      loc_end_ssid = i;
    }

    ssid_local += c;
  }

  // Încarcă parola din următoarele 64 de bytes ale EEPROM
  password_local = "";
  for (int i = 32; i < 96; ++i)
  {
    char c = EEPROM.read(i);
    if (c == '\0')
      break;
    if (c == '\2')
    {
      loc_end_length_pass = i-32;
    }
    if (c == '\3')
    {
      loc_end_pass = i-32;
    }
    password_local += c;
  }

  ssid = ssid_local;
  password = password_local;
  length_ssid = loc_end_length_ssid;
  length_pass = loc_end_length_pass;
  end_ssid = loc_end_ssid;
  end_pass = loc_end_pass;
  EEPROM.end(); // Termină utilizarea EEPROM
}
String list_wifi_networks()
{
  String responseHTML = "<select id='ssid' name=\"ssid\">"; //<input type=\"text\" name=\"ssid\">
  // Scanarea rețelelor WiFi disponibile
  Serial.println("Scanning for networks...");
  // Scanarea rețelelor WiFi disponibile
  int numNetworks = WiFi.scanNetworks();
  if (numNetworks == 0)
  {
    responseHTML += "<option value='no wifi'>No networks found</option>";
  }
  else
  {
    for (int i = 0; i < numNetworks; ++i)
    {
      responseHTML += "<option value='" + WiFi.SSID(i) + "'>" + WiFi.SSID(i) + "</option>";
    }
  }

  responseHTML += "</select>";
  return responseHTML;
}

void notFound(AsyncWebServerRequest *request)
{
  request->send(404, "text/plain", "Not found");
}

std::string getSerialMessages()
{
  std::string messages;
  // Implementează logica pentru a citi mesajele de pe portul serial și le adaugă la sirul "messages"
  while (Serial.available())
  {
    char c = Serial.read();
    messages += c;
  }
  return messages;
}

void Setup_and_Start_Server()
{
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
  {
  String html_script = R"(  <!-- Alte elemente head... -->
  <script>
    function getSerialMessages() {
      var xhttp = new XMLHttpRequest();
      xhttp.onreadystatechange = function() {
        if (this.readyState == 4 && this.status == 200) 
        {
          // Actualizeaza lista de mesaje cu raspunsul primit
          document.getElementById("messages").innerHTML = this.responseText;
        }
      };
      xhttp.open("GET", "/getMessages", true);
      xhttp.send();
    }
    function clearMessages() {
      // Sterge continutul text box-ului
      document.getElementById("messages").value = '';
    }
    // Actualizează mesajele la fiecare 2 secunde (sau în intervalul dorit)
    setInterval(getSerialMessages, 2000);
  </script>)";
    String html = "<html><head>";
    html += html_script;
    html += "<style>";
    html += "body { font-family: Arial, sans-serif; text-align: center; }";
    html += "button { padding: 10px 20px; font-size: 16px; margin: 10px; }";
    html += "</style>";
    html += "</head><body>";
    html += "<h1>Weather station configuration </h1>";

    html += "<form action=\"/connect\" method=\"post\">";
    html += "SSID: " + List_of_wifi_networks_HTML + "<br>"; //<input type=\"text\" name=\"ssid\">
    html += "Password: <input type=\"password\" name=\"password\"><br>";
    html += "<input type=\"submit\" value=\"Connect\"></form><br> <hr>";
    html += "<br><label for='Wifi network'>Select Wifi network:</label>";
    html += "<br>" + List_of_wifi_networks_HTML;

    //html += "<label for='SSID'>SSID</label>";
    //html += "<input type='string' id='SSID' placeholder='Input SSID'><br>";

    html += "<br><label for='password'>password</label>";
    html += "<input type='string' id='password' placeholder='Input password'><br>";
    html += "<button id='reconnect'>Reconect Wifi</button>";

    html += "<br><br><button id='saveButton'>Save Credentials</button>";
    html += "<button id='stopButton'>Stop</button>";
    html += "<button id='backwardButton'>Backward</button>";
   // html += "<br><button onclick = 'clearMessages()' id='clearButton'> Clear serial messages</button>";
    html += "<!--Lista pentru afisarea mesajelor-->";
    // html += "<br><ul id=\"messages\"> </ul>";
    html += "<br><textarea id = 'messages' rows = '20' cols = '50'></textarea>";
    html += "<br><button onclick = 'clearMessages()' id='clearButton'> Clear serial messages</button>";
    html += "<script>";
    html += "document.getElementById('startRotationButton').onclick = function() {";
    html += "   var rotations = document.getElementById('rotationsInput').value;";
    html += "   var direction = document.getElementById('directionSelect').value;";
    html += "   sendCommand('/startRotation?rotations=' + rotations + '&direction=' + direction);";
    html += "};";
    html += "document.getElementById('saveButton').onclick = function() {";
    html += "   sendCommand('/save');";
    html += "};";
    html += "document.getElementById('stopButton').onclick = function() {";
    html += "   sendCommand('/stop');";
    html += "};";
    html += "document.getElementById('backwardButton').onclick = function() {";
    html += "   sendCommand('/backward');";
    html += "};";
    html += "document.getElementById('clearButton').onclick = function() {";
    html += "   document.getElementById(\"messages\").value = '';";
    html += "};";
    html += "function sendCommand(command) {";
    html += "   var xhr = new XMLHttpRequest();";
    html += "   xhr.open('GET', command, true);";
    html += "   xhr.send();";
    html += "}";
    html += "</script>";
    html += "</body></html>";

    request->send(200, "text/html", html); });

  server.on("/connect", HTTP_POST, handleConnect);

