SimedruF/ESP32_LILYGOT5_WeatherStation/main.cpp
  server.on("/success", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    Serial.println("Reconnection successfully done !");
    request->send(200, "text/plain", "success"); 
  });
  server.on("/save", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(200, "text/plain", "forward"); 
  });

  server.on("/backward", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(200, "text/plain", "backward"); 
  });

  server.on("/stop", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    Serial.println("Stop spinning !");
    request->send(200, "text/plain", "stop"); 
  });

  server.on("/startRotation", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    String rotationsParam = request->getParam("rotations")->value();
    //directionParam = request->getParam("direction")->value();
    request->send(200, "text/plain", "Free Rotation"); 
  });

  // Configurare rută pentru obținerea mesajelor de pe portul serial
  server.on("/getMessages", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    // Obtinerea mesajelor de pe portul serial și trimiterea către client
    msg = getSerialMessages();
    if (msg.empty() == false)
    {
      messages = messages + '\n' + ">>" + msg;
      new_serial_data = true;
    }
    request->send(200, "text/plain", String(messages.c_str())); 
  });

  server.onNotFound(notFound);
  server.begin();
  Serial.println("HTTP server started");  
}

void handleConnect(AsyncWebServerRequest *request)
{
  String network = newSSID;
  String password = newPass;
  Serial.println("handleConnect...");

  if (request->method() == HTTP_POST)
  {
    if (request->hasParam("ssid", true) && request->hasParam("password", true))
    {
      AsyncWebParameter *ssidParam = request->getParam("ssid", true);
      AsyncWebParameter *passwordParam = request->getParam("password", true);

      newSSID = ssidParam->value();
      newPass = passwordParam->value();
      Serial.println(newSSID);
      Serial.println(newPass);
      trigger_reconnect = true;
      // Redirecționează utilizatorul către o pagină care indică succesul
      request->redirect("/");
      return;
    }
  }
}

void handleSaveCredentials(AsyncWebServerRequest *request)
{
  String network = newSSID;
  String password = newPass;
  Serial.println("handleSaveCredentials...");

  if (request->method() == HTTP_POST)
  {
    if (request->hasParam("ssid", true) && request->hasParam("password", true))
    {
      AsyncWebParameter *ssidParam = request->getParam("ssid", true);
      AsyncWebParameter *passwordParam = request->getParam("password", true);

      newSSID = ssidParam->value();
      newPass = passwordParam->value();
      Serial.println(newSSID);
      Serial.println(newPass);
      trigger_reconnect = true;
      // Redirecționează utilizatorul către o pagină care indică succesul
      request->redirect("/");
      return;
    }
  }
}

String CheckString(String name, String str)
{
  if ((str == "null") || (str.isEmpty() == true))
  {
    return "NA";
  }
  else
  {
    return name;
  }
}
void SecureClientRead()
{
  WiFiClientSecure *clientSec = new WiFiClientSecure;
  if (clientSec)
  {
    clientSec->setCACert(test_root_ca);
    {
      // Add a scoping block for HTTPClient https to make sure it is destroyed before WiFiClientSecure *client is
      HTTPClient https;
      https.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);

      Serial.print("[HTTPS] begin...\n");
      if (https.begin(*clientSec, weather_server))
      { // HTTPS
        Serial.print("[HTTPS] GET...\n");
        // start connection and send HTTP header
        int httpCode = https.GET();

        // httpCode will be negative on error
        if (httpCode > 0)
        {
          // HTTP header has been send and Server response header has been handled
          Serial.printf("[HTTPS] GET... code: %d\n", httpCode);

          // file found at server
          if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)
          {
#ifdef SERIAL_DEBUG_ON
            String payload = https.getString();
            Serial.println(payload);
#endif
            // Parse response
            DynamicJsonDocument doc(65000);
            DynamicJsonDocument doc_city(2000);
            deserializeJson(doc, https.getStream());
#ifdef SERIAL_DEBUG_ON
            Serial.println(doc["features"][CITY_CODE].as<String>());
#endif
            if (city_code_cfg == 0)
            {
              for (int i = 0; i < 161; i++)
              {
                doc_city = doc["features"][i];
                deserializeJson(doc_city, doc["features"][i].as<String>());
                oras = doc_city["properties"]["nume"].as<String>();
                if (oras == configured_city_str)
                {
                  city_code_cfg = i;
#ifdef SERIAL_DEBUG_ON
                  Serial.printf("\nCity Code CFG: %d\n", city_code_cfg);
#endif
                }
              }
            }
            else
            {
              doc_city = doc["features"][city_code_cfg];
              deserializeJson(doc_city, doc["features"][city_code_cfg].as<String>());
              // Read values
              data_meteo = doc["date"].as<String>();
#ifdef SERIAL_DEBUG_ON
              Serial.println(doc["features"][city_code_cfg].as<String>());
              Serial.println(doc_city["properties"]["tempe"].as<String>());
              Serial.println(doc["date"].as<String>());
#endif
              oras = doc_city["properties"]["nume"].as<String>();
              temperatura_locala = doc_city["properties"]["tempe"].as<String>();
              presiunea_locala = doc_city["properties"]["presiunetext"].as<String>();
              viteza_vantului_locala = doc_city["properties"]["vant"].as<String>();
              nebulozitate = doc_city["properties"]["nebulozitate"].as<String>();
              umezeala = doc_city["properties"]["umezeala"].as<String>();
              fenomene_precippitatii = doc_city["properties"]["fenomen_e"].as<String>();
              zapada = doc_city["properties"]["zapada"].as<String>();
              actualizat = doc_city["properties"]["actualizat"].as<String>();
            }
          }
        }
        else
        {
          Serial.printf("[HTTPS] GET... failed, error: %s\n", https.errorToString(httpCode).c_str());
        }

        https.end();
      }
      else
      {
        Serial.printf("[HTTPS] Unable to connect\n");
      }

      // End extra scoping block
    }
    delete clientSec;
  }
  else
  {
    Serial.println("Unable to create client");
  }
}

