SimedruF/ESP32_LILYGOT5_WeatherStation/main.cpp
wl_status_t wifi_connect(String ssid, String password,bool new_connection)
{
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  List_of_wifi_networks_HTML = list_wifi_networks();
  Serial.println(List_of_wifi_networks_HTML);
  Serial.println(ssid);
  Serial.println(password);
  if (new_connection == true)
  {
    WiFi.begin(ssid.c_str(), password.c_str());
    int new_connection_in_progress = 0;
    while (WiFi.status() != WL_CONNECTED)
    {
      delay(1000);
      new_connection_in_progress++;
#ifdef SERIAL_DEBUG_ON
      Serial.print(".");
#endif
      if (new_connection_in_progress > 30)
      {
        break;
      }
      Serial.printf(" \nConnection attempt %d ..", new_connection_in_progress);
    }
    Serial.println("");
    Serial.printf("Connected to WiFi %s network with IP Address: %s", newSSID.c_str(),WiFi.localIP().toString());
    trigger_reconnect = false;
    saveCredentials(newSSID, newPass);
    return WiFi.status();
  }
  else
  {
    WiFi.begin(ssid.c_str(), password.c_str());
  }
#ifdef SERIAL_DEBUG_ON
  Serial.println("Connecting");
#endif
  int connection_in_progress=0;
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(1000);
    connection_in_progress++;
#ifdef SERIAL_DEBUG_ON
    Serial.print(".");
#endif
    if (connection_in_progress > 30)
    {
      break;
    }
    Serial.printf(" \nConnection attempt %d ..", connection_in_progress);
  }
  if (WiFi.status() != WL_CONNECTED)
  {
    // Creează un hotspot WiFi
    WiFi.softAPConfig(apIP, gateway, netMsk); // Configurează adresa IP a punctului de acces WiFi
    WiFi.softAP(apSSID, apPassword);
    Serial.println("");
    Serial.println("Access point configured !");
    Serial.println(WiFi.softAPIP());
    access_point_configured = true;
  }
  else
  {

  #ifdef SERIAL_DEBUG_ON
    Serial.println("");
    Serial.print("Connected to WiFi network with IP Address: ");
    Serial.println(WiFi.localIP());
  #endif
    WiFi.setAutoReconnect(true);
    WiFi.persistent(true);
    saveCredentials(ssid, password);
    access_point_configured = false;
  }
  return WiFi.status();
}

void setup(void)
{
  String saved_SSID;
  String saved_password;
#ifdef SERIAL_DEBUG_ON
  Serial.begin(115200);
  Serial.println();
  Serial.println("setup");
#endif
  int length_ssid = 0;
  int length_pass = 0;
  int end_ssid = 0;
  int end_pass = 0;
  loadCredentials(saved_SSID, saved_password, length_ssid, length_pass, end_ssid, end_pass);
  Serial.printf("\nLength ssid %d - end ssid %d", length_ssid, end_ssid);
  Serial.printf("\nLength pass %d - end pass %d\n", length_pass, end_pass);
  Serial.println(saved_SSID.substring(length_ssid + 1, end_ssid));
  Serial.println(saved_password.substring(length_pass + 1, end_pass));
  saved_SSID = saved_SSID.substring(length_ssid + 1, end_ssid);
  saved_password = saved_password.substring(length_pass + 1, end_pass);

  if (saved_SSID.isEmpty() && saved_password.isEmpty())
  {
    wifi_connect(String(ssid), String(password), trigger_reconnect);
  }
  else
  {
    wifi_connect(saved_SSID.c_str(),saved_password.c_str(),trigger_reconnect);
  }


  if (WiFi.status() != WL_CONNECTED)
  {
     // Creează un hotspot WiFi
     //WiFi.softAP(apSSID, apPassword);
  }
  else
  {
#ifdef SERIAL_DEBUG_ON
    Serial.println("");
    Serial.print("Connected to WiFi network with IP Address: ");
    Serial.println(WiFi.localIP());
  #endif
    WiFi.setAutoReconnect(true);
    WiFi.persistent(true);
    Serial.print("IP Address: ");
    Serial.println(WiFi.localIP());

    setup_clock();
  #ifdef SERIAL_DEBUG_ON
    Serial.println(printLocalTime());
  #endif
  }
  Setup_and_Start_Server();

#if defined(LILYGO_EPD_DISPLAY_102)
  pinMode(EPD_POWER_ENABLE, OUTPUT);
  digitalWrite(EPD_POWER_ENABLE, HIGH);
#endif /*LILYGO_EPD_DISPLAY_102*/
#if defined(LILYGO_T5_V102)
  pinMode(POWER_ENABLE, OUTPUT);
  digitalWrite(POWER_ENABLE, HIGH);
#endif /*LILYGO_T5_V102*/
  

  SPI.begin(EPD_SCLK, EPD_MISO, EPD_MOSI);
  display.init(); // enable diagnostic output on Serial


#ifdef SERIAL_DEBUG_ON
  Serial.println("setup done");
#endif
  printPanel();
  qrcode.init(255, 122);
  display.setCursor(2, 60);
  qrcode.debug();
  if (WiFi.status() == WL_CONNECTED)
  {
    // connecting to a mqtt broker
    client.setServer(mqtt_broker, mqtt_port);
    client.setCallback(callback);
    int mqtt_connection_attempts = 0;
    while (!client.connected())
    {
        String client_id = "esp32-client-";
        client_id += String(WiFi.macAddress());
        Serial.printf("The client %s connects to the public MQTT broker\n", client_id.c_str());
        if (client.connect(client_id.c_str(), mqtt_username, mqtt_password))
        {
          Serial.println("Public EMQX MQTT broker connected");
          // Publish and subscribe
          client.publish(topic_general, "Hi, I'm ESP32 LilyGo T5 ");
          client.subscribe(topic_general);
          client.subscribe(topic_temperatura);
        }
        else
        {
          Serial.println("failed with state ");
          Serial.print(client.state());
          if (mqtt_connection_attempts > 10)
          {
            break;
          }
          delay(2000);
        }
        mqtt_connection_attempts++;
     }
   }
   display.update();
}

void loop()
{
  if(trigger_reconnect == true)
  {
    wl_status_t newCon;
    newCon = wifi_connect(newSSID, newPass, trigger_reconnect);
    if(newCon == WL_CONNECTED)
    {
      saveCredentials(newSSID, newPass);
      trigger_reconnect = false;
    }
  }
  display.setRotation(1);
  display.fillScreen(GxEPD_WHITE);
  display.setTextColor(GxEPD_BLACK);
  display.setFont(&FreeMono9pt7b);
  display.setCursor(2, 20);
  display.println(printLocalTime().c_str());
  
  if (millis() - ClockSec >= 500)
  { // 500 milisec = 1/2 sec
    display.updateWindow(0, 250, 450, 40, true); // update clock window
    // update 500ms clock 
    ClockSec = millis();
  }
  display.setCursor(2, 40);
  display.setCursor(103, 20);
  if (WiFi.status() == WL_CONNECTED)
  {
    int bars = getWifiStrenght();
    if (access_point_configured == false)
    {
      String wifi_name = WiFi.SSID();
      int length = wifi_name.length();
      if(length > 6)
      {
        wifi_name = wifi_name.substring(0, 6) + ".(" + String(getWifiStrenght()) + ")";
      }
      else
      {
        wifi_name = WiFi.SSID() + "(" + String(getWifiStrenght()) + ")";
      }
      display.printf("%s", wifi_name.c_str()); // WiFi.SSID().c_str(), getWifiStrenght());
    }
    drawWifiStrenght(bars);
    
