SimedruF/ESP32_LILYGOT5_WeatherStation/main.cpp
    client.loop();
    if (millis() - Clock30Sec >= 30000)
    { // 30000 milisec = 30 sec
      SecureClientRead();
      // update clock variable
      Clock30Sec = millis();
    }
  }
  else
  {
    if (access_point_configured == true)
    {
      display.printf("%s", WiFi.softAPIP().toString());
    }
    else
    {
      display.println("NC");
    }
  }
  printPanel();

  /*Title */
  display.setFont(&FreeMono9pt7b);
  display.setCursor(2, 40);
  display.println(&timeinfo, "%d-%b-%Y");
  display.println("T ext " + temperatura_locala + "C");
  display.setCursor(2, 73);
  display.println("T int " + temp_int.substring(1,6)+"C");
  display.setCursor(2, 88);
  display.println("Hum "+ umezeala+ "%");
  int virgula = viteza_vantului_locala.indexOf(',');
  String doar_viteza = viteza_vantului_locala.substring(0, virgula);
  display.setCursor(2, 103);
  display.println("Wind " + doar_viteza);

  /* Content*/
  display.setCursor(2, 60);
  if(access_point_configured == true)
  {
    // create qrcode for access point address
    qrcode.create("http://192.168.2.1:80");
  }
  else
  {
    // create qrcode
    qrcode.create("https://www.meteoromania.ro/vremea/starea-vremii-romania/");
  }
  /* Footer*/
  display.setFont(&FreeMono9pt7b);
  display.setCursor(2, 123);
  display.print("");
  int virgula_pres = presiunea_locala.indexOf(',');
  String doar_presiunea = presiunea_locala.substring(0, virgula_pres);
  display.print("Atm " + doar_presiunea);

  if (millis() - Clock1Sec >= 1000)
  {
    // display.update();
    display.updateWindow(100, 6, 170, 20, true); // update wifi name
    display.updateWindow(0, 6, 250, 40, true);   // update date window
    display.updateWindow(0, 45, 250, 65, true);  // update content window
    display.updateWindow(0, 108, 250, 20, true); // update footer
    // Actualizăm momentul ultimului apel
    Clock1Sec = millis();
  }
#ifdef INA219_CHECK
  // Initialize the INA219.
  // By default the initialization will use the largest range (32V, 2A).  However
  // you can call a setCalibration function to change this range (see comments).
  if (!ina219.begin())
  {
    Serial.println("Failed to find INA219 chip");
    while (1)
    {
      delay(10);
    }
  }
  else
  {
    // display.updateWindow(230, 6, 20, 20, false);
  }
#endif    
  
}

/*----------------------------------------------------*/
void printPanel()
{

  printHeader();
  /*               x  y width height           */
  /* Title*/
  display.drawRect(0, 25, 150, 20, GxEPD_BLACK); // clock

  /*Content*/
  display.drawRect(0, 45, 150, 65, GxEPD_BLACK);  // content window which contain 

  /*footer*/
  display.drawRect(0, 108, 150, 20, GxEPD_BLACK); // footer panel
}

void printHeader()
{
  /*               x  y width height           */
  display.drawRect(0, 6, 100, 20, GxEPD_BLACK);   // date
  display.drawRect(100, 6, 170, 20, GxEPD_BLACK); // wifi name 
  display.drawRect(230, 6, 20, 20, GxEPD_BLACK);  // battery panel
  printBatStatus(busvoltage_f / 6.0 * 100.0);
}

void printBatStatus(float battery_proc)
{
  int number_of_lines_to_draw = (int)round((battery_proc / 100.0 * 12.0));
#ifdef SERIAL_DEBUG_DISPLAY_ON
  Serial.printf("Battery procentage: %f\n", battery_proc);
  Serial.printf("Nr de linii: %d", number_of_lines_to_draw);
#endif
  if (number_of_lines_to_draw > 14)
  {
    number_of_lines_to_draw = 14;
  }
  /* Draw empty battery*/
  /*               x  y width height           */
  display.drawRect(235, 10, 10, 14, GxEPD_BLACK);
  display.drawFastHLine(238, 8, 4, GxEPD_BLACK);
  display.drawFastHLine(238, 9, 4, GxEPD_BLACK);

  /* Fill battery based on battery_proc parameter */
  for (int i = 0; i < number_of_lines_to_draw; i++)
  {
    display.drawFastHLine(235, 22 - i, 10, GxEPD_BLACK);
  }

  if (number_of_lines_to_draw < 3)
  {
    display.drawLine(230, 6, 250, 26, GxEPD_BLACK);
  }
  else
  {
    display.setCursor(236, 20);
    display.setFont(&Picopixel);
    display.setTextColor(GxEPD_WHITE);
    display.printf("%1.1f", busvoltage_f);
  }
  display.setTextColor(GxEPD_BLACK);
}

void drawWifiStrenght(int bars)
{
  /*               x  y width height           */
  for (int i = 1; i <= bars; i++)
  {
    if (i == 5)
    {
      display.fillRect(204 + (i * 4), 26 - (i * 4) + 2, 3, (i * 4) - 5, GxEPD_BLACK);
#ifdef SERIAL_DEBUG_DISPLAY_ON
      Serial.printf("\nHeight max: %d", (i * 4) - 5);
#endif
    }
    else
    {
      display.fillRect(204 + (i * 4), 26 - (i * 4), 3, (i * 4) - 3, GxEPD_BLACK);
#ifdef SERIAL_DEBUG_DISPLAY_ON
      Serial.printf("\nHeight: %d", (i * 4) - 3);
#endif
    }
  }
}

String printLocalTime()
{
  if (!getLocalTime(&timeinfo))
  {
#ifdef SERIAL_TIME_DATE_ON
    Serial.println("Failed to obtain time");
#endif
    return String("NC");
  }
#ifdef SERIAL_TIME_DATE_ON
  Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
  Serial.print("Day of week: ");
  Serial.println(&timeinfo, "%A");
  Serial.print("Month: ");
  Serial.println(&timeinfo, "%B");
  Serial.print("Day of Month: ");
  Serial.println(&timeinfo, "%d");
  Serial.print("Year: ");
  Serial.println(&timeinfo, "%Y");
  Serial.print("Hour: ");
  Serial.println(&timeinfo, "%H");
  Serial.print("Hour (12 hour format): ");
  Serial.println(&timeinfo, "%I");
  Serial.print("Minute: ");
  Serial.println(&timeinfo, "%M");
  Serial.print("Second: ");
  Serial.println(&timeinfo, "%S");

  Serial.println("Time variables");
  char timeHour[3];
  char timeHMS[12];
  strftime(timeHour, 3, "%H", &timeinfo);
  strftime(timeHMS, 11, "%H:%M:%S", &timeinfo);
  Serial.println(timeHour);
  char timeWeekDay[10];
  strftime(timeWeekDay, 10, "%A", &timeinfo);
  Serial.println(timeWeekDay);
  Serial.println();
#endif
  char timeDate[36];
  strftime(timeDate, 36, "%H:%M:%S", &timeinfo);
  return String(timeDate);
}

int getWifiStrenght()
{
  int bars;
  int RSSI_strgh = 0;
  // simple if then to set the number of bars
  RSSI_strgh = WiFi.RSSI();
  if (RSSI_strgh > -55)
  {
    bars = 5;
  }
  else if ((RSSI_strgh < -55) && (RSSI_strgh > -65))
  {
    bars = 4;
  }
  else if ((RSSI_strgh < -65) && (RSSI_strgh > -70))
  {
    bars = 3;
  }
  else if ((RSSI_strgh < -70) && (RSSI_strgh > -78))
  {
    bars = 2;
  }
  else if ((RSSI_strgh < -78) & (RSSI_strgh > -82))
  {
    bars = 1;
  }
  else
  {
    bars = 0;
  }
  return bars;
}

void callback(char *topic, byte *payload, unsigned int length)
{
  
  Serial.print("Message arrived in topic: ");
  Serial.println(topic);
  Serial.print("Message:");
  snprintf(mesage_mqtt, length+1, "%s", payload);
  String msg(mesage_mqtt);
  int dpct = msg.indexOf(':');
  int br = msg.indexOf('}');
  temp_int = msg.substring(dpct, br);
  Serial.printf("%s", mesage_mqtt);
  Serial.println();
  Serial.println("-----------------------");
}
#ifdef INA219_CHECK
void batteryRead(void)
{
  float shuntvoltage = 0;
  float busvoltage = 0;
  float current_mA = 0;
  float loadvoltage = 0;
  float power_mW = 0;

  shuntvoltage = ina219.getShuntVoltage_mV();
  busvoltage = ina219.getBusVoltage_V();
  current_mA = ina219.getCurrent_mA();
  power_mW = ina219.getPower_mW();
  loadvoltage = busvoltage + (shuntvoltage / 1000);

  Serial.print("Bus Voltage:   ");
  Serial.print(busvoltage);
  busvoltage_s = String(loadvoltage);
  busvoltage_f = loadvoltage;
  Serial.println(" V");
  Serial.print("Shunt Voltage: ");
  Serial.print(shuntvoltage);
  Serial.println(" mV");
  Serial.print("Load Voltage:  ");
  Serial.print(loadvoltage);
  Serial.println(" V");
  Serial.print("Current:       ");
  Serial.print(current_mA);
  Serial.println(" mA");
  Serial.print("Power:         ");
  Serial.print(power_mW);
  Serial.println(" mW");
  Serial.println("");

  delay(2000);
}
#endif
void setup_clock()
{
  rtc.setTime(00, 29, 19, 10, 3, 2024); // 3th March 2024 20:18:30
  if (WiFi.status() == WL_CONNECTED)
  {
    /*---------set with NTP---------------*/
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
    struct tm timeinfo;
    if (getLocalTime(&timeinfo))
    {
      rtc.setTimeStruct(timeinfo);
    }
  }
  else
  {  
    //wifi_connection = wifi_connect();
  }

}
